## Staging: rds
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 19 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                                 NAME                                                 |
|--------|------------------------------------------------------------------------------------------------------|
| add    | `module.rds_activity_stream[0].aws_cloudwatch_log_group.decrypt`                                     |
|        | `module.rds_activity_stream[0].aws_cloudwatch_log_group.firehose_activity_stream`                    |
|        | `module.rds_activity_stream[0].aws_cloudwatch_log_stream.firehose_activity_stream`                   |
|        | `module.rds_activity_stream[0].aws_iam_policy.decrypt`                                               |
|        | `module.rds_activity_stream[0].aws_iam_policy.firehose_activity_stream`                              |
|        | `module.rds_activity_stream[0].aws_iam_role.decrypt`                                                 |
|        | `module.rds_activity_stream[0].aws_iam_role.firehose_activity_stream`                                |
|        | `module.rds_activity_stream[0].aws_iam_role_policy_attachment.decrypt`                               |
|        | `module.rds_activity_stream[0].aws_iam_role_policy_attachment.firehose_activity_stream`              |
|        | `module.rds_activity_stream[0].aws_kinesis_firehose_delivery_stream.activity_stream`                 |
|        | `module.rds_activity_stream[0].aws_kms_key.activity_stream`                                          |
|        | `module.rds_activity_stream[0].aws_lambda_function.decrypt`                                          |
|        | `module.rds_activity_stream[0].aws_lambda_layer_version.decrypt_deps`                                |
|        | `module.rds_activity_stream[0].aws_lambda_permission.lambda_permission`                              |
|        | `module.rds_activity_stream[0].aws_rds_cluster_activity_stream.activity_stream`                      |
|        | `module.rds_activity_stream[0].random_string.bucket_suffix`                                          |
|        | `module.rds_activity_stream[0].terraform_data.decrypt_deps`                                          |
|        | `module.rds_activity_stream[0].module.activity_stream_bucket.aws_s3_bucket.this`                     |
|        | `module.rds_activity_stream[0].module.activity_stream_bucket.aws_s3_bucket_public_access_block.this` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.rds_activity_stream[0].data.archive_file.decrypt_deps will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "decrypt_deps" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "/tmp/decrypt_deps.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = ".terraform/modules/rds_activity_stream/rds_activity_stream/lambda/layer"
      + type                = "zip"
    }

  # module.rds_activity_stream[0].data.aws_iam_policy_document.decrypt will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "decrypt" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "CloudWatchWriteLogs"
        }
      + statement {
          + actions   = [
              + "kinesis:ListStreams",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
          + sid       = "KinesisListStreams"
        }
      + statement {
          + actions   = [
              + "kinesis:DescribeStream",
              + "kinesis:DescribeStreamSummary",
              + "kinesis:GetRecords",
              + "kinesis:GetShardIterator",
              + "kinesis:ListShards",
              + "kinesis:ListStreams",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "KinesisReadDBActivityStream"
        }
      + statement {
          + actions   = [
              + "kms:Decrypt",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "KMSDecryptDatabaseActivityStream"
        }
    }

  # module.rds_activity_stream[0].data.aws_iam_policy_document.firehose_activity_stream will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "firehose_activity_stream" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:AbortMultipartUpload",
              + "s3:GetBucketLocation",
              + "s3:GetObject",
              + "s3:ListBucket",
              + "s3:ListBucketMultipartUploads",
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
          + sid       = "S3Write"
        }
      + statement {
          + actions   = [
              + "kinesis:ListStreams",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
          + sid       = "KinesisListStreams"
        }
      + statement {
          + actions   = [
              + "kinesis:DescribeStream",
              + "kinesis:DescribeStreamSummary",
              + "kinesis:GetRecords",
              + "kinesis:GetShardIterator",
              + "kinesis:ListShards",
              + "kinesis:ListStreams",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "KinesisReadDBActivityStream"
        }
      + statement {
          + actions   = [
              + "kms:Decrypt",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "KMSDecryptDatabaseActivityStream"
        }
      + statement {
          + actions   = [
              + "lambda:GetFunctionConfiguration",
              + "lambda:InvokeFunction",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "LambdaInvokeDecrypt"
        }
    }

  # module.rds_activity_stream[0].aws_cloudwatch_log_group.decrypt will be created
  + resource "aws_cloudwatch_log_group" "decrypt" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/notification-canada-ca-staging-cluster-decrypt-activity"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
    }

  # module.rds_activity_stream[0].aws_cloudwatch_log_group.firehose_activity_stream will be created
  + resource "aws_cloudwatch_log_group" "firehose_activity_stream" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/kinesis/notification-canada-ca-staging-cluster-activity"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
    }

  # module.rds_activity_stream[0].aws_cloudwatch_log_stream.firehose_activity_stream will be created
  + resource "aws_cloudwatch_log_stream" "firehose_activity_stream" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + log_group_name = "/aws/kinesis/notification-canada-ca-staging-cluster-activity"
      + name           = "logs"
    }

  # module.rds_activity_stream[0].aws_iam_policy.decrypt will be created
  + resource "aws_iam_policy" "decrypt" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "notification-canada-ca-staging-cluster-decrypt-activity"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
    }

  # module.rds_activity_stream[0].aws_iam_policy.firehose_activity_stream will be created
  + resource "aws_iam_policy" "firehose_activity_stream" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "notification-canada-ca-staging-cluster-firehose-activity"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
    }

  # module.rds_activity_stream[0].aws_iam_role.decrypt will be created
  + resource "aws_iam_role" "decrypt" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "notification-canada-ca-staging-cluster-decrypt-activity"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)
    }

  # module.rds_activity_stream[0].aws_iam_role.firehose_activity_stream will be created
  + resource "aws_iam_role" "firehose_activity_stream" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "firehose.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "notification-canada-ca-staging-cluster-firehose-activity"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)
    }

  # module.rds_activity_stream[0].aws_iam_role_policy_attachment.decrypt will be created
  + resource "aws_iam_role_policy_attachment" "decrypt" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "notification-canada-ca-staging-cluster-decrypt-activity"
    }

  # module.rds_activity_stream[0].aws_iam_role_policy_attachment.firehose_activity_stream will be created
  + resource "aws_iam_role_policy_attachment" "firehose_activity_stream" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "notification-canada-ca-staging-cluster-firehose-activity"
    }

  # module.rds_activity_stream[0].aws_kinesis_firehose_delivery_stream.activity_stream will be created
  + resource "aws_kinesis_firehose_delivery_stream" "activity_stream" {
      + arn            = (known after apply)
      + destination    = "extended_s3"
      + destination_id = (known after apply)
      + id             = (known after apply)
      + name           = "notification-canada-ca-staging-cluster-activity"
      + tags           = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + version_id     = (known after apply)

      + extended_s3_configuration {
          + bucket_arn         = (known after apply)
          + buffering_interval = 300
          + buffering_size     = 5
          + compression_format = "UNCOMPRESSED"
          + role_arn           = (known after apply)
          + s3_backup_mode     = "Disabled"

          + cloudwatch_logging_options {
              + enabled         = true
              + log_group_name  = "/aws/kinesis/notification-canada-ca-staging-cluster-activity"
              + log_stream_name = "logs"
            }

          + processing_configuration {
              + enabled = true

              + processors {
                  + type = "Lambda"

                  + parameters {
                      + parameter_name  = "LambdaArn"
                      + parameter_value = (known after apply)
                    }
                }
            }
        }

      + kinesis_source_configuration {
          + kinesis_stream_arn = (known after apply)
          + role_arn           = (known after apply)
        }
    }

  # module.rds_activity_stream[0].aws_kms_key.activity_stream will be created
  + resource "aws_kms_key" "activity_stream" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "Encrypts the notification-canada-ca-staging-cluster RDS activity stream"
      + enable_key_rotation                = false
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + tags                               = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + tags_all                           = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
    }

  # module.rds_activity_stream[0].aws_lambda_function.decrypt will be created
  + resource "aws_lambda_function" "decrypt" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "/tmp/decrypt.zip"
      + function_name                  = "notification-canada-ca-staging-cluster-decrypt-activity"
      + handler                        = "decrypt.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 256
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "HptAYdkkYNjBbL+Oet3+WFfTnvfss1oyLz1fVAy22/8="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + timeout                        = 5
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }
    }

  # module.rds_activity_stream[0].aws_lambda_layer_version.decrypt_deps will be created
  + resource "aws_lambda_layer_version" "decrypt_deps" {
      + arn                         = (known after apply)
      + compatible_runtimes         = [
          + "python3.12",
        ]
      + created_date                = (known after apply)
      + filename                    = "/tmp/decrypt_deps.zip"
      + id                          = (known after apply)
      + layer_arn                   = (known after apply)
      + layer_name                  = "decrypt-deps"
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + skip_destroy                = false
      + source_code_hash            = (known after apply)
      + source_code_size            = (known after apply)
      + version                     = (known after apply)
    }

  # module.rds_activity_stream[0].aws_lambda_permission.lambda_permission will be created
  + resource "aws_lambda_permission" "lambda_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "notification-canada-ca-staging-cluster-decrypt-activity"
      + id                  = (known after apply)
      + principal           = "firehose.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = (known after apply)
      + statement_id_prefix = (known after apply)
    }

  # module.rds_activity_stream[0].aws_rds_cluster_activity_stream.activity_stream will be created
  + resource "aws_rds_cluster_activity_stream" "activity_stream" {
      + engine_native_audit_fields_included = false
      + id                                  = (known after apply)
      + kinesis_stream_name                 = (known after apply)
      + kms_key_id                          = (known after apply)
      + mode                                = "async"
      + resource_arn                        = "arn:aws:rds:ca-central-1:239043911459:cluster:notification-canada-ca-staging-cluster"
    }

  # module.rds_activity_stream[0].random_string.bucket_suffix will be created
  + resource "random_string" "bucket_suffix" {
      + id          = (known after apply)
      + length      = 8
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.rds_activity_stream[0].terraform_data.decrypt_deps will be created
  + resource "terraform_data" "decrypt_deps" {
      + id               = (known after apply)
      + triggers_replace = [
          + "313599deb90c232694dc474a206e72c5805c83b819a4de21c8cdc918129155f9",
          + "f22c090110bf8e1b630f0fe53b1cd3a988a8b5c557c894758ea45fba803f4870",
        ]
    }

  # module.rds_activity_stream[0].module.activity_stream_bucket.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Critical"   = "false"
          + "Terraform"  = "true"
        }
      + tags_all                    = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Critical"   = "false"
          + "Terraform"  = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + lifecycle_rule {
          + enabled = true
          + id      = "expire-objects"

          + expiration {
              + days                         = 4
              + expired_object_delete_marker = false
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = false

              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }
    }

  # module.rds_activity_stream[0].module.activity_stream_bucket.aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

Plan: 19 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.rds_activity_stream[0].module.activity_stream_bucket.aws_s3_bucket.this,
  on .terraform/modules/rds_activity_stream.activity_stream_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_server_side_encryption_configuration resource instead

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_db_event_subscription.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_db_event_subscription.notification-canada-ca-cluster"]
WARN - plan.json - main - Missing Common Tags: ["aws_db_subnet_group.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_instance.notification-canada-ca-instances[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_instance.notification-canada-ca-instances[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_instance.notification-canada-ca-instances[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_parameter_group.default"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.app_db_user"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.database_user"]
WARN - plan.json - main - Missing Common Tags: ["module.rds_proxy.aws_cloudwatch_log_group.this[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.rds_proxy.aws_db_proxy.this[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.rds_proxy.aws_db_proxy_endpoint.this[\"read_only\"]"]
WARN - plan.json - main - Missing Common Tags: ["module.rds_proxy.aws_db_proxy_endpoint.this[\"read_write\"]"]
WARN - plan.json - main - Missing Common Tags: ["module.rds_proxy.aws_iam_role.this[0]"]

34 tests, 19 passed, 15 warnings, 0 failures, 0 exceptions

```

</details>
